Ac6Embedded/svd-microchip/PIC32CX_BZ3/PIC32WM_BZ3601.svd
            <register>
               <name>ADCFLTR2</name>
               <addressOffset>0x1b0</addressOffset>
               <fields>
                  <field>
                     <name>FLT_DATA1</name>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
                  <field>
                     <name>FLTINID1</name>
                     <bitOffset>16</bitOffset>
                     <bitWidth>5</bitWidth>
                  </field>
                  <field>
                     <name>AFIF1</name>
                     <bitOffset>24</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>AFIEN1</name>
                     <bitOffset>25</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>OVRSAM1</name>
                     <bitOffset>26</bitOffset>
                     <bitWidth>3</bitWidth>
                  </field>
                  <field>
                     <name>ADFMODE1</name>
                     <bitOffset>29</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DATA16EN1</name>
                     <bitOffset>30</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>AFEN1</name>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>ADCTRG1</name>
               <description>ADC Trigger Source 1 Register</description>
               <addressOffset>0x200</addressOffset>
               <fields>
                  <field>
                     <name>TRGSRC0</name>
                     <description>Trigger Source for Conversion of ADC0 Module Select bits</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>5</bitWidth>
                     <writeConstraint>
                        <useEnumeratedValues>true</useEnumeratedValues>
                     </writeConstraint>
                     <enumeratedValues>
                        <name>TRGSRC0Select</name>
                        <enumeratedValue>
                           <name>EVSYS_47</name>
                           <description>ADC_TRIG_16</description>
                           <value>0x10</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>EVSYS_46</name>
                           <description>ADC_TRIG_15</description>
                           <value>0xf</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>EVSYS_45</name>
                           <description>ADC_TRIG_14</description>
                           <value>0xe</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>EVSYS_44</name>
                           <description>ADC_TRIG_13</description>
                           <value>0xd</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>EVSYS_43</name>
                           <description>ADC_TRIG_12</description>
                           <value>0xc</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>EVSYS_42</name>
                           <description>ADC_TRIG_11</description>
                           <value>0xb</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>EVSYS_41</name>
                           <description>ADC_TRIG_10</description>
                           <value>0xa</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>EVSYS_40</name>
                           <description>ADC_TRIG_9</description>
                           <value>0x9</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>EVSYS_39</name>
                           <description>ADC_TRIG_8</description>
                           <value>0x8</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>EVSYS_38</name>
                           <description>ADC_TRIG_7</description>
                           <value>0x7</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>EVSYS_37</name>
                           <description>ADC_TRIG_6</description>
                           <value>0x6</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>EVSYS_36</name>
                           <description>ADC_TRIG_5</description>
                           <value>0x5</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>INT0</name>
                           <description>INT0</description>
                           <value>0x4</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SCAN_TRIG</name>
                           <description>Scan trigger</description>
                           <value>0x3</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SW_LVL</name>
                           <description>Software level trigger</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SW_EDGE</name>
                           <description>Software edge trigger</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>NONE</name>
                           <description>No Trigger</description>
                           <value>0x0</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>TRGSRC1</name>
                     <description>Trigger Source for Conversion of ADC1 Module Select bits</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>5</bitWidth>
                     <writeConstraint>
                        <useEnumeratedValues>true</useEnumeratedValues>
                     </writeConstraint>
                     <enumeratedValues>
                        <name>TRGSRC1Select</name>
                        <enumeratedValue>
                           <name>EVSYS_47</name>
                           <description>ADC_TRIG_16</description>
                           <value>0x10</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>EVSYS_46</name>
                           <description>ADC_TRIG_15</description>
                           <value>0xf</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>EVSYS_45</name>
                           <description>ADC_TRIG_14</description>
                           <value>0xe</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>EVSYS_44</name>
                           <description>ADC_TRIG_13</description>
                           <value>0xd</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>EVSYS_43</name>
                           <description>ADC_TRIG_12</description>
                           <value>0xc</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>EVSYS_42</name>
                           <description>ADC_TRIG_11</description>
                           <value>0xb</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>EVSYS_41</name>
                           <description>ADC_TRIG_10</description>
                           <value>0xa</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>EVSYS_40</name>
                           <description>ADC_TRIG_9</description>
                           <value>0x9</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>EVSYS_39</name>
                           <description>ADC_TRIG_8</description>
                           <value>0x8</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>EVSYS_38</name>
                           <description>ADC_TRIG_7</description>
                           <value>0x7</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>EVSYS_37</name>
                           <description>ADC_TRIG_6</description>
                           <value>0x6</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>EVSYS_36</name>
                           <description>ADC_TRIG_5</description>
                           <value>0x5</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>INT0</name>
                           <description>INT0</description>
                           <value>0x4</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SCAN_TRIG</name>
                           <description>Scan trigger</description>
                           <value>0x3</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SW_LVL</name>
                           <description>Software level trigger</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SW_EDGE</name>
                           <description>Software edge trigger</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>NONE</name>
                           <description>No Trigger</description>
                           <value>0x0</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>TRGSRC2</name>
                     <description>Trigger Source for Conversion of ADC2 Module Select bits</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>5</bitWidth>
                     <writeConstraint>
                        <useEnumeratedValues>true</useEnumeratedValues>
                     </writeConstraint>
                     <enumeratedValues>
                        <name>TRGSRC2Select</name>
                        <enumeratedValue>
                           <name>EVSYS_47</name>
                           <description>ADC_TRIG_16</description>
                           <value>0x10</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>EVSYS_46</name>
                           <description>ADC_TRIG_15</description>
                           <value>0xf</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>EVSYS_45</name>
                           <description>ADC_TRIG_14</description>
                           <value>0xe</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>EVSYS_44</name>
                           <description>ADC_TRIG_13</description>
                           <value>0xd</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>EVSYS_43</name>
                           <description>ADC_TRIG_12</description>
                           <value>0xc</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>EVSYS_42</name>
                           <description>ADC_TRIG_11</description>
                           <value>0xb</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>EVSYS_41</name>
                           <description>ADC_TRIG_10</description>
                           <value>0xa</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>EVSYS_40</name>
                           <description>ADC_TRIG_9</description>
                           <value>0x9</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>EVSYS_39</name>
                           <description>ADC_TRIG_8</description>
                           <value>0x8</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>EVSYS_38</name>
                           <description>ADC_TRIG_7</description>
                           <value>0x7</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>EVSYS_37</name>
                           <description>ADC_TRIG_6</description>
                           <value>0x6</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>EVSYS_36</name>
                           <description>ADC_TRIG_5</description>
                           <value>0x5</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>INT0</name>
                           <description>INT0</description>
                           <value>0x4</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SCAN_TRIG</name>
                           <description>Scan trigger</description>
                           <value>0x3</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SW_LVL</name>
                           <description>Software level trigger</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SW_EDGE</name>
                           <description>Software edge trigger</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>NONE</name>
                           <description>No Trigger</description>
                           <value>0x0</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>TRGSRC3</name>
                     <description>Trigger Source for Conversion of ADC3 Module Select bits</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>5</bitWidth>
                     <writeConstraint>
                        <useEnumeratedValues>true</useEnumeratedValues>
                     </writeConstraint>
                     <enumeratedValues>
                        <name>TRGSRC3Select</name>
                        <enumeratedValue>
                           <name>EVSYS_47</name>
                           <description>ADC_TRIG_16</description>
                           <value>0x10</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>EVSYS_46</name>
                           <description>ADC_TRIG_15</description>
                           <value>0xf</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>EVSYS_45</name>
                           <description>ADC_TRIG_14</description>
                           <value>0xe</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>EVSYS_44</name>
                           <description>ADC_TRIG_13</description>
                           <value>0xd</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>EVSYS_43</name>
                           <description>ADC_TRIG_12</description>
                           <value>0xc</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>EVSYS_42</name>
                           <description>ADC_TRIG_11</description>
                           <value>0xb</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>EVSYS_41</name>
                           <description>ADC_TRIG_10</description>
                           <value>0xa</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>EVSYS_40</name>
                           <description>ADC_TRIG_9</description>
                           <value>0x9</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>EVSYS_39</name>
                           <description>ADC_TRIG_8</description>
                           <value>0x8</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>EVSYS_38</name>
                           <description>ADC_TRIG_7</description>
                           <value>0x7</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>EVSYS_37</name>
                           <description>ADC_TRIG_6</description>
                           <value>0x6</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>EVSYS_36</name>
                           <description>ADC_TRIG_5</description>
                           <value>0x5</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>INT0</name>
                           <description>INT0</description>
                           <value>0x4</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SCAN_TRIG</name>
                           <description>Scan trigger</description>
                           <value>0x3</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SW_LVL</name>
                           <description>Software level trigger</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SW_EDGE</name>
                           <description>Software edge trigger</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>NONE</name>
                           <description>No Trigger</description>
                           <value>0x0</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
