Ac6Embedded/svd-microchip/PIC32CX_BZ3/PIC32WM_BZ3601.svd
         </registers>
      </peripheral>
      <peripheral>
         <name>DMAC</name>
         <version>U25031.0.1</version>
         <description>Direct Memory Access Controller</description>
         <baseAddress>0x41004000</baseAddress>
         <addressBlock>
            <offset>0</offset>
            <size>0x140</size>
            <usage>registers</usage>
         </addressBlock>
         <interrupt>
            <name>DMAC_0_3</name>
            <description>DMA Channel 0..3</description>
            <value>6</value>
         </interrupt>
         <interrupt>
            <name>DMAC_4_15</name>
            <description>DMA Channel 4..15</description>
            <value>7</value>
         </interrupt>
         <registers>
            <register>
               <name>CTRL</name>
               <description>Control</description>
               <addressOffset>0x0</addressOffset>
               <size>16</size>
               <fields>
                  <field>
                     <name>SWRST</name>
                     <description>Software Reset</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DMAENABLE</name>
                     <description>DMA Enable</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LVLEN0</name>
                     <description>Priority Level 0 Enable</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LVLEN1</name>
                     <description>Priority Level 1 Enable</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LVLEN2</name>
                     <description>Priority Level 2 Enable</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LVLEN3</name>
                     <description>Priority Level 3 Enable</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CRCCTRL</name>
               <description>CRC Control</description>
               <addressOffset>0x2</addressOffset>
               <size>16</size>
               <fields>
                  <field>
                     <name>CRCBEATSIZE</name>
                     <description>CRC Beat Size</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>2</bitWidth>
                     <writeConstraint>
                        <useEnumeratedValues>true</useEnumeratedValues>
                     </writeConstraint>
                     <enumeratedValues>
                        <name>CRCBEATSIZESelect</name>
                        <enumeratedValue>
                           <name>BYTE</name>
                           <description>8-bit bus transfer</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>HWORD</name>
                           <description>16-bit bus transfer</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>WORD</name>
                           <description>32-bit bus transfer</description>
                           <value>0x2</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>CRCPOLY</name>
                     <description>CRC Polynomial Type</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>2</bitWidth>
                     <writeConstraint>
                        <useEnumeratedValues>true</useEnumeratedValues>
                     </writeConstraint>
                     <enumeratedValues>
                        <name>CRCPOLYSelect</name>
                        <enumeratedValue>
                           <name>CRC16</name>
                           <description>CRC-16 (CRC-CCITT)</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CRC32</name>
                           <description>CRC32 (IEEE 802.3)</description>
                           <value>0x1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>CRCSRC</name>
                     <description>CRC Input Source</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>6</bitWidth>
                     <writeConstraint>
                        <useEnumeratedValues>true</useEnumeratedValues>
                     </writeConstraint>
                     <enumeratedValues>
                        <name>CRCSRCSelect</name>
                        <enumeratedValue>
                           <name>DISABLE</name>
                           <description>CRC Disabled</description>
                           <value>0x00</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>IO</name>
                           <description>I/O interface</description>
                           <value>0x01</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>CRCMODE</name>
                     <description>CRC Operating Mode</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>2</bitWidth>
                     <writeConstraint>
                        <useEnumeratedValues>true</useEnumeratedValues>
                     </writeConstraint>
                     <enumeratedValues>
                        <name>CRCMODESelect</name>
                        <enumeratedValue>
                           <name>DEFAULT</name>
                           <description>Default operating mode</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CRCMON</name>
                           <description>Memory CRC monitor operating mode</description>
                           <value>2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CRCGEN</name>
                           <description>Memory CRC generation operating mode</description>
                           <value>3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>CRCDATAIN</name>
               <description>CRC Data Input</description>
               <addressOffset>0x4</addressOffset>
               <fields>
                  <field>
                     <name>CRCDATAIN</name>
                     <description>CRC Data Input</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CRCCHKSUM</name>
               <description>CRC Checksum</description>
               <addressOffset>0x8</addressOffset>
               <fields>
                  <field>
                     <name>CRCCHKSUM</name>
                     <description>CRC Checksum</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CRCSTATUS</name>
               <description>CRC Status</description>
               <addressOffset>0xC</addressOffset>
               <size>8</size>
               <fields>
                  <field>
                     <name>CRCBUSY</name>
                     <description>CRC Module Busy</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CRCZERO</name>
                     <description>CRC Zero</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CRCERR</name>
                     <description>CRC Error</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>DBGCTRL</name>
               <description>Debug Control</description>
               <addressOffset>0xD</addressOffset>
               <size>8</size>
               <fields>
                  <field>
                     <name>DBGRUN</name>
                     <description>Debug Run</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>SWTRIGCTRL</name>
               <description>Software Trigger Control</description>
               <addressOffset>0x10</addressOffset>
               <fields>
                  <field>
                     <name>SWTRIG0</name>
                     <description>Channel 0 Software Trigger</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SWTRIG1</name>
                     <description>Channel 1 Software Trigger</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SWTRIG2</name>
                     <description>Channel 2 Software Trigger</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SWTRIG3</name>
                     <description>Channel 3 Software Trigger</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SWTRIG4</name>
                     <description>Channel 4 Software Trigger</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SWTRIG5</name>
                     <description>Channel 5 Software Trigger</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SWTRIG6</name>
                     <description>Channel 6 Software Trigger</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SWTRIG7</name>
                     <description>Channel 7 Software Trigger</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SWTRIG8</name>
                     <description>Channel 8 Software Trigger</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SWTRIG9</name>
                     <description>Channel 9 Software Trigger</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SWTRIG10</name>
                     <description>Channel 10 Software Trigger</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SWTRIG11</name>
                     <description>Channel 11 Software Trigger</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SWTRIG12</name>
                     <description>Channel 12 Software Trigger</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SWTRIG13</name>
                     <description>Channel 13 Software Trigger</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SWTRIG14</name>
                     <description>Channel 14 Software Trigger</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SWTRIG15</name>
                     <description>Channel 15 Software Trigger</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>PRICTRL0</name>
               <description>Priority Control 0</description>
               <addressOffset>0x14</addressOffset>
               <resetValue>0x40404040</resetValue>
               <fields>
                  <field>
                     <name>LVLPRI0</name>
                     <description>Level 0 Channel Priority Number</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>5</bitWidth>
                  </field>
                  <field>
                     <name>QOS0</name>
                     <description>Level 0 Quality of Service</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>2</bitWidth>
                     <writeConstraint>
                        <useEnumeratedValues>true</useEnumeratedValues>
                     </writeConstraint>
                     <enumeratedValues>
                        <name>QOS0Select</name>
                        <enumeratedValue>
                           <name>REGULAR</name>
                           <description>Regular delivery</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SHORTAGE</name>
                           <description>Bandwidth shortage</description>
                           <value>1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SENSITIVE</name>
                           <description>Latency sensitive</description>
                           <value>2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CRITICAL</name>
                           <description>Latency critical</description>
                           <value>3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>RRLVLEN0</name>
                     <description>Level 0 Round-Robin Scheduling Enable</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LVLPRI1</name>
                     <description>Level 1 Channel Priority Number</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>5</bitWidth>
                  </field>
                  <field>
                     <name>QOS1</name>
                     <description>Level 1 Quality of Service</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>2</bitWidth>
                     <writeConstraint>
                        <useEnumeratedValues>true</useEnumeratedValues>
                     </writeConstraint>
                     <enumeratedValues>
                        <name>QOS1Select</name>
                        <enumeratedValue>
                           <name>REGULAR</name>
                           <description>Regular delivery</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SHORTAGE</name>
                           <description>Bandwidth shortage</description>
                           <value>1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SENSITIVE</name>
                           <description>Latency sensitive</description>
                           <value>2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CRITICAL</name>
                           <description>Latency critical</description>
                           <value>3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>RRLVLEN1</name>
                     <description>Level 1 Round-Robin Scheduling Enable</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LVLPRI2</name>
                     <description>Level 2 Channel Priority Number</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>5</bitWidth>
                  </field>
                  <field>
                     <name>QOS2</name>
                     <description>Level 2 Quality of Service</description>
                     <bitOffset>21</bitOffset>
                     <bitWidth>2</bitWidth>
                     <writeConstraint>
                        <useEnumeratedValues>true</useEnumeratedValues>
                     </writeConstraint>
                     <enumeratedValues>
                        <name>QOS2Select</name>
                        <enumeratedValue>
                           <name>REGULAR</name>
                           <description>Regular delivery</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SHORTAGE</name>
                           <description>Bandwidth shortage</description>
                           <value>1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SENSITIVE</name>
                           <description>Latency sensitive</description>
                           <value>2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CRITICAL</name>
                           <description>Latency critical</description>
                           <value>3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>RRLVLEN2</name>
                     <description>Level 2 Round-Robin Scheduling Enable</description>
                     <bitOffset>23</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LVLPRI3</name>
                     <description>Level 3 Channel Priority Number</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>5</bitWidth>
                  </field>
                  <field>
                     <name>QOS3</name>
                     <description>Level 3 Quality of Service</description>
                     <bitOffset>29</bitOffset>
                     <bitWidth>2</bitWidth>
                     <writeConstraint>
                        <useEnumeratedValues>true</useEnumeratedValues>
                     </writeConstraint>
                     <enumeratedValues>
                        <name>QOS3Select</name>
                        <enumeratedValue>
                           <name>REGULAR</name>
                           <description>Regular delivery</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SHORTAGE</name>
                           <description>Bandwidth shortage</description>
                           <value>1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SENSITIVE</name>
                           <description>Latency sensitive</description>
                           <value>2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CRITICAL</name>
                           <description>Latency critical</description>
                           <value>3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>RRLVLEN3</name>
                     <description>Level 3 Round-Robin Scheduling Enable</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
