Ac6Embedded/svd-microchip/PIC32CX_BZ3/PIC32WM_BZ3601.svd
            <register>
               <name>TC2WO0G3R</name>
               <addressOffset>0xcc</addressOffset>
               <fields>
                  <field>
                     <name>TC2WO0</name>
                     <description>TC2/WO0G3</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>4</bitWidth>
                     <writeConstraint>
                        <useEnumeratedValues>true</useEnumeratedValues>
                     </writeConstraint>
                     <enumeratedValues>
                        <name>TC2WO0Select</name>
                        <enumeratedValue>
                           <name>RPA5</name>
                           <description>RPA5</description>
                           <value>1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RPA9</name>
                           <description>RPA9</description>
                           <value>2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RPB6</name>
                           <description>RPB6</description>
                           <value>5</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RPA4</name>
                           <description>RPA4</description>
                           <value>8</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RPA8</name>
                           <description>RPA8</description>
                           <value>9</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RPB5</name>
                           <description>RPB5</description>
                           <value>12</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RPB9</name>
                           <description>RPB9</description>
                           <value>13</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>OFF</name>
                           <description>OFF</description>
                           <value>0</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>TC2WO1G2R</name>
               <addressOffset>0xd0</addressOffset>
               <fields>
                  <field>
                     <name>TC2WO1</name>
                     <description>TC2/WO1G2</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>4</bitWidth>
                     <writeConstraint>
                        <useEnumeratedValues>true</useEnumeratedValues>
                     </writeConstraint>
                     <enumeratedValues>
                        <name>TC2WO1Select</name>
                        <enumeratedValue>
                           <name>RPA4</name>
                           <description>RPA4</description>
                           <value>1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RPA8</name>
                           <description>RPA8</description>
                           <value>2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RPB5</name>
                           <description>RPB5</description>
                           <value>5</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RPB9</name>
                           <description>RPB9</description>
                           <value>6</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RPA3</name>
                           <description>RPA3</description>
                           <value>8</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RPA7</name>
                           <description>RPA7</description>
                           <value>9</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RPB4</name>
                           <description>RPB4</description>
                           <value>12</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RPB8</name>
                           <description>RPB8</description>
                           <value>13</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>OFF</name>
                           <description>OFF</description>
                           <value>0</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>TC2WO1G4R</name>
               <addressOffset>0xd4</addressOffset>
               <fields>
                  <field>
                     <name>TC2WO1</name>
                     <description>TC2/WO1G4</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>4</bitWidth>
                     <writeConstraint>
                        <useEnumeratedValues>true</useEnumeratedValues>
                     </writeConstraint>
                     <enumeratedValues>
                        <name>TC2WO1Select</name>
                        <enumeratedValue>
                           <name>RPA6</name>
                           <description>RPA6</description>
                           <value>1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RPA10</name>
                           <description>RPA10</description>
                           <value>2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RPB7</name>
                           <description>RPB7</description>
                           <value>5</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RPA5</name>
                           <description>RPA5</description>
                           <value>8</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RPA9</name>
                           <description>RPA9</description>
                           <value>9</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RPB6</name>
                           <description>RPB6</description>
                           <value>12</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RPA8</name>
                           <description>RPA8</description>
                           <value>14</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>OFF</name>
                           <description>OFF</description>
                           <value>0</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>TC3WO0G1R</name>
               <addressOffset>0xd8</addressOffset>
               <fields>
                  <field>
                     <name>TC3WO0</name>
                     <description>TC3/WO0G1</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>4</bitWidth>
                     <writeConstraint>
                        <useEnumeratedValues>true</useEnumeratedValues>
                     </writeConstraint>
                     <enumeratedValues>
                        <name>TC3WO0Select</name>
                        <enumeratedValue>
                           <name>RPA9</name>
                           <description>RPA9</description>
                           <value>15</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RPA3</name>
                           <description>RPA3</description>
                           <value>1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RPA7</name>
                           <description>RPA7</description>
                           <value>2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RPB4</name>
                           <description>RPB4</description>
                           <value>5</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RPB8</name>
                           <description>RPB8</description>
                           <value>6</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RPA6</name>
                           <description>RPA6</description>
                           <value>9</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RPA10</name>
                           <description>RPA10</description>
                           <value>10</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RPB7</name>
                           <description>RPB7</description>
                           <value>13</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>OFF</name>
                           <description>OFF</description>
                           <value>0</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>TC3WO0G3R</name>
               <addressOffset>0xdc</addressOffset>
               <fields>
                  <field>
                     <name>TC3WO0</name>
                     <description>TC3/WO0G3</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>4</bitWidth>
                     <writeConstraint>
                        <useEnumeratedValues>true</useEnumeratedValues>
                     </writeConstraint>
                     <enumeratedValues>
                        <name>TC3WO0Select</name>
                        <enumeratedValue>
                           <name>RPA5</name>
                           <description>RPA5</description>
                           <value>1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RPA9</name>
                           <description>RPA9</description>
                           <value>2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RPB6</name>
                           <description>RPB6</description>
                           <value>5</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RPA4</name>
                           <description>RPA4</description>
                           <value>8</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RPA8</name>
                           <description>RPA8</description>
                           <value>9</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RPB5</name>
                           <description>RPB5</description>
                           <value>12</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RPB9</name>
                           <description>RPB9</description>
                           <value>13</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>OFF</name>
                           <description>OFF</description>
                           <value>0</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>TC3WO1G2R</name>
               <addressOffset>0xe0</addressOffset>
               <fields>
                  <field>
                     <name>TC3WO1</name>
                     <description>TC3/WO1G2</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>4</bitWidth>
                     <writeConstraint>
                        <useEnumeratedValues>true</useEnumeratedValues>
                     </writeConstraint>
                     <enumeratedValues>
                        <name>TC3WO1Select</name>
                        <enumeratedValue>
                           <name>RPA4</name>
                           <description>RPA4</description>
                           <value>1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RPA8</name>
                           <description>RPA8</description>
                           <value>2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RPB5</name>
                           <description>RPB5</description>
                           <value>5</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RPB9</name>
                           <description>RPB9</description>
                           <value>6</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RPA3</name>
                           <description>RPA3</description>
                           <value>8</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RPA7</name>
                           <description>RPA7</description>
                           <value>9</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RPB4</name>
                           <description>RPB4</description>
                           <value>12</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RPB8</name>
                           <description>RPB8</description>
                           <value>13</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>OFF</name>
                           <description>OFF</description>
                           <value>0</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>TC3WO1G4R</name>
               <addressOffset>0xe4</addressOffset>
               <fields>
                  <field>
                     <name>TC3WO1</name>
                     <description>TC3/WO1G4</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>4</bitWidth>
                     <writeConstraint>
                        <useEnumeratedValues>true</useEnumeratedValues>
                     </writeConstraint>
                     <enumeratedValues>
                        <name>TC3WO1Select</name>
                        <enumeratedValue>
                           <name>RPA6</name>
                           <description>RPA6</description>
                           <value>1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RPA10</name>
                           <description>RPA10</description>
                           <value>2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RPB7</name>
                           <description>RPB7</description>
                           <value>5</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RPA5</name>
                           <description>RPA5</description>
                           <value>8</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RPA9</name>
                           <description>RPA9</description>
                           <value>9</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RPB6</name>
                           <description>RPB6</description>
                           <value>12</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RPA8</name>
                           <description>RPA8</description>
                           <value>14</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>OFF</name>
                           <description>OFF</description>
                           <value>0</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>TC4WO0G1R</name>
               <addressOffset>0xe8</addressOffset>
               <fields>
                  <field>
                     <name>TC4WO0</name>
                     <description>TC4/WO0G1</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>4</bitWidth>
                     <writeConstraint>
                        <useEnumeratedValues>true</useEnumeratedValues>
                     </writeConstraint>
                     <enumeratedValues>
                        <name>TC4WO0Select</name>
                        <enumeratedValue>
                           <name>RPA9</name>
                           <description>RPA9</description>
                           <value>15</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RPA3</name>
                           <description>RPA3</description>
                           <value>1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RPA7</name>
                           <description>RPA7</description>
                           <value>2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RPB4</name>
                           <description>RPB4</description>
                           <value>5</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RPB8</name>
                           <description>RPB8</description>
                           <value>6</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RPA6</name>
                           <description>RPA6</description>
                           <value>9</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RPA10</name>
                           <description>RPA10</description>
                           <value>10</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RPB7</name>
                           <description>RPB7</description>
                           <value>13</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>OFF</name>
                           <description>OFF</description>
                           <value>0</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
